Саракташ2/src/DataProcessors/ПерераспределениеИзделий/ПерераспределениеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПерераспределениеИзделий</name>
</mdclass:DataProcessor>

Саракташ2/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/AccumulationRegisters/ТоварыВРезерве/ТоварыВРезерве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезерве</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>DocumentRef.РезервированиеТоваров</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.РасходыНаУслуги</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезерве</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПерезвонить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаСайте</name>
    <comment>Дата заказа на сайте</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПокупателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>CatalogRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиССайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДополнительныхРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидкиССайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаценкаОпт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНаценкуОпт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльСЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльСЗаказаСУчетомДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяУказанноеПриОформленииЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗамененныеПозиции</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>НазначениеСкидки</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.МетодыОплаты</types>
        <types>EnumRef.НазначенияСкидок</types>
        <types>CatalogRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Упаковка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/DataProcessors/ПерераспределениеИзделий/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкрытьНаОжидании = Истина;
	ЗаполнитьДерево();
	
КонецПроцедуры

Процедура ЗаполнитьДерево()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.Количество КАК ЗаказКоличество,
	|	0 КАК ЗаказОжидает
	|ПОМЕСТИТЬ втЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Статус.ТоварРезервируется
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	0,
	|	ЗаказПокупателяТовары.Количество
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.Статус В(&мсСтатусыОжидает)
	|	И НЕ &СкрытьНаОжидании
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказы.Номенклатура КАК Номенклатура,
	|	СУММА(втЗаказы.ЗаказКоличество) КАК ЗаказКоличествоВсего,
	|	СУММА(втЗаказы.ЗаказОжидает) КАК ЗаказОжидаетВсего
	|ПОМЕСТИТЬ втНоменклатураЗаказано
	|ИЗ
	|	втЗаказы КАК втЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоДоступно
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					втНоменклатураЗаказано.Номенклатура КАК Номенклатура
	|				ИЗ
	|					втНоменклатураЗаказано КАК втНоменклатураЗаказано)) КАК ЗапасыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВРезервеОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ втРезервыВсего
	|ИЗ
	|	РегистрНакопления.ТоварыВРезерве.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					втНоменклатураЗаказано.Номенклатура КАК Номенклатура
	|				ИЗ
	|					втНоменклатураЗаказано КАК втНоменклатураЗаказано)) КАК ТоварыВРезервеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатураЗаказано.Номенклатура КАК Номенклатура,
	|	втНоменклатураЗаказано.ЗаказКоличествоВсего КАК ЗаказКоличествоВсего,
	|	втНоменклатураЗаказано.ЗаказОжидаетВсего КАК ЗаказОжидаетВсего,
	|	ЕСТЬNULL(втОстатки.КоличествоДоступно, 0) - ЕСТЬNULL(втРезервыВсего.КоличествоОстаток, 0) КАК КоличествоДоступно,
	|	ЕСТЬNULL(втРезервыВсего.КоличествоОстаток, 0) КАК КоличествоРезерв
	|ПОМЕСТИТЬ втНоменклатураНехватает
	|ИЗ
	|	втНоменклатураЗаказано КАК втНоменклатураЗаказано
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
	|		ПО втНоменклатураЗаказано.Номенклатура = втОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРезервыВсего КАК втРезервыВсего
	|		ПО втНоменклатураЗаказано.Номенклатура = втРезервыВсего.Номенклатура
	|ГДЕ
	|	(втНоменклатураЗаказано.ЗаказКоличествоВсего > ЕСТЬNULL(втОстатки.КоличествоДоступно, 0)
	|			ИЛИ втНоменклатураЗаказано.ЗаказОжидаетВсего <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеОстатки.ДокументРезерва КАК ДокументРезерва,
	|	ТоварыВРезервеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВРезервеОстатки.КоличествоОстаток КАК РезервПоЗаказу
	|ПОМЕСТИТЬ втРезервыПоЗаказам
	|ИЗ
	|	РегистрНакопления.ТоварыВРезерве.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					втНоменклатураЗаказано.Номенклатура КАК Номенклатура
	|				ИЗ
	|					втНоменклатураЗаказано КАК втНоменклатураЗаказано)) КАК ТоварыВРезервеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказы.Заказ КАК Заказ,
	|	втЗаказы.Заказ.Статус КАК ЗаказСтатус,
	|	втЗаказы.Заказ.СпособДоставки КАК ЗаказСпособДоставки,
	|	втЗаказы.Заказ.МетодОплаты КАК ЗаказМетодОплаты,
	|	втЗаказы.Номенклатура КАК Номенклатура,
	|	втЗаказы.ЗаказКоличество КАК ЗаказКоличество,
	|	втЗаказы.ЗаказОжидает КАК ЗаказОжидает,
	|	втНоменклатураНехватает.ЗаказКоличествоВсего КАК ЗаказКоличествоВсего,
	|	втНоменклатураНехватает.ЗаказОжидаетВсего КАК ЗаказОжидаетВсего,
	|	втНоменклатураНехватает.КоличествоДоступно КАК КоличествоДоступно,
	|	втНоменклатураНехватает.КоличествоРезерв КАК КоличествоРезерв,
	|	ЕСТЬNULL(втРезервыПоЗаказам.РезервПоЗаказу, 0) КАК РезервПоЗаказу
	|ИЗ
	|	втЗаказы КАК втЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНоменклатураНехватает КАК втНоменклатураНехватает
	|		ПО втЗаказы.Номенклатура = втНоменклатураНехватает.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРезервыПоЗаказам КАК втРезервыПоЗаказам
	|		ПО втЗаказы.Заказ = втРезервыПоЗаказам.ДокументРезерва
	|			И втЗаказы.Номенклатура = втРезервыПоЗаказам.Номенклатура
	|ИТОГИ ПО
	|	Номенклатура,
	|	КоличествоДоступно,
	|	КоличествоРезерв,
	|	ЗаказКоличествоВсего,
	|	ЗаказОжидаетВсего";
	
	
	//Пока поле ожидает выкосил
		
	мсСтатусыОтбор = Новый Массив;
	мсСтатусыОтбор.Добавить(Справочники.СтатусыЗаказов.Новый);	
	Запрос.УстановитьПараметр("мсСтатусыОтбор", мсСтатусыОтбор);
	
	мсСтатусыОжидает = Новый Массив;
	мсСтатусыОжидает.Добавить(Справочники.СтатусыЗаказов.НайтиПоНаименованию("Ожидается поступление товара"));	
	Запрос.УстановитьПараметр("мсСтатусыОжидает", мсСтатусыОжидает);
	
	Запрос.УстановитьПараметр("СкрытьНаОжидании", СкрытьНаОжидании);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	//Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НовыйДерево = Новый ДеревоЗначений;
	НовыйДерево.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НовыйДерево.Колонки.Добавить("КоличествоОстаток", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	НовыйДерево.Колонки.Добавить("КоличествоДоступно", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	НовыйДерево.Колонки.Добавить("КоличествоРезерв", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));	
	НовыйДерево.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	НовыйДерево.Колонки.Добавить("ЗаказКоличество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	НовыйДерево.Колонки.Добавить("ЗаказОжидает", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	НовыйДерево.Колонки.Добавить("IDНаСайте", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(11,0)));
	НовыйДерево.Колонки.Добавить("ОжидатьИзделие", Новый ОписаниеТипов("Булево"));
	НовыйДерево.Колонки.Добавить("ЗаказСтатус", Новый ОписаниеТипов("СправочникСсылка.СтатусыЗаказов"));
	НовыйДерево.Колонки.Добавить("ЗаказСпособДоставки", Новый ОписаниеТипов("СправочникСсылка.СпособыДоставки"));
	НовыйДерево.Колонки.Добавить("ЗаказМетодОплаты", Новый ОписаниеТипов("СправочникСсылка.МетодыОплаты"));
	
	Пока Выборка.Следующий() Цикл //Номенклатура
		
		ВыборкаКоличествоОстаток = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКоличествоОстаток.Следующий() Цикл
			
			ВыборкаКоличествоРезерв =  ВыборкаКоличествоОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКоличествоРезерв.Следующий() Цикл				
				
				ВыборкаЗаказКоличество =  ВыборкаКоличествоРезерв.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЗаказКоличество.Следующий() Цикл
					
					ВыборкаЗаказОжидает =  ВыборкаЗаказКоличество.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);				
					Пока ВыборкаЗаказОжидает.Следующий() Цикл
						
						нСтрокаНомерклатура = НовыйДерево.Строки.Добавить();		
						нСтрокаНомерклатура.Номенклатура = ВыборкаЗаказОжидает.Номенклатура;
						нСтрокаНомерклатура.КоличествоДоступно = ВыборкаЗаказОжидает.КоличествоДоступно;
						нСтрокаНомерклатура.КоличествоРезерв = ВыборкаЗаказОжидает.КоличествоРезерв;
						нСтрокаНомерклатура.КоличествоОстаток = ВыборкаЗаказОжидает.КоличествоДоступно - ВыборкаЗаказКоличество.ЗаказКоличествоВсего;
						нСтрокаНомерклатура.ЗаказКоличество = ВыборкаЗаказОжидает.ЗаказКоличествоВсего;
						нСтрокаНомерклатура.ЗаказОжидает = ВыборкаЗаказОжидает.ЗаказОжидаетВсего;
						
						ВыборкаЗаказ = ВыборкаЗаказОжидает.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаЗаказ.Следующий() Цикл 
							
							нСтрокаЗаказ = нСтрокаНомерклатура.Строки.Добавить();
							нСтрокаЗаказ.Номенклатура = ПустаяНоменклатураДляОформления;
							нСтрокаЗаказ.Заказ = ВыборкаЗаказ.Заказ;
							нСтрокаЗаказ.IDНаСайте = ВыборкаЗаказ.Заказ.IDНаСайте;
							нСтрокаЗаказ.ЗаказКоличество = ВыборкаЗаказ.ЗаказКоличество;
							нСтрокаЗаказ.КоличествоРезерв = ВыборкаЗаказ.РезервПоЗаказу;
							нСтрокаЗаказ.ЗаказОжидает = ВыборкаЗаказ.ЗаказОжидает;
							нСтрокаЗаказ.ЗаказСтатус = ВыборкаЗаказ.ЗаказСтатус;
							нСтрокаЗаказ.ЗаказСпособДоставки = ВыборкаЗаказ.ЗаказСпособДоставки;
							нСтрокаЗаказ.ЗаказМетодОплаты = ВыборкаЗаказ.ЗаказМетодОплаты;
							нСтрокаЗаказ.ОжидатьИзделие = нСтрокаЗаказ.ЗаказОжидает <> 0;							
							
						КонецЦикла;
						
					КонецЦикла; 				
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;		
		
	КонецЦикла;	 	
	
	ЗначениеВРеквизитФормы(НовыйДерево, "Дерево");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДерево(Команда)
 	ЗаполнитьДерево();	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Заказ) Тогда 
		ОткрытьЗначение(Элемент.ТекущиеДанные.Заказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	СтатусНовый = Справочники.СтатусыЗаказов.Новый;
	СтатусОжидаетИзделие = Справочники.СтатусыЗаказов.НайтиПоКоду("000000014"); //Ожидается поступление товара
	
	ЭлементыНоменклатура = Дерево.ПолучитьЭлементы();	
	Для Каждого СтрокаНоменклатура ИЗ ЭлементыНоменклатура Цикл //Номенклатура
		
		ЭлементыЗаказ = СтрокаНоменклатура.ПолучитьЭлементы() ;
		
		//Заказ
		Для Каждого СтрокаЗаказ Из ЭлементыЗаказ Цикл 
			
			Если СтрокаЗаказ.ЗаказСтатус <> СтатусОжидаетИзделие И СтрокаЗаказ.ОжидатьИзделие Тогда 
				
				Заказ = СтрокаЗаказ.Заказ.ПолучитьОбъект();
				Заказ.Статус = СтатусОжидаетИзделие;
				Заказ.Записать();
				
			КонецЕсли;
			
			Если СтрокаЗаказ.ЗаказСтатус = СтатусОжидаетИзделие И НЕ СтрокаЗаказ.ОжидатьИзделие Тогда 
				
				Заказ = СтрокаЗаказ.Заказ.ПолучитьОбъект();
				Заказ.Статус = СтатусНовый;
				Заказ.Записать();
				
			КонецЕсли;			
			
		КонецЦикла;		
		
	КонецЦикла;
	
	ЗаполнитьДерево();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНаОжиданииПриИзменении(Элемент)
	ЗаполнитьДерево();
КонецПроцедуры
